app/controllers/admin_controller.rb

  def upyun

    return unless valid_auth? # 权限验证

    # 保存数据
    if(params[:code] != nil and params[:code].to_i == 200)
      up = Upyun.new
      up.url = params[:url]
      up.width = params[:url].to_i
      up.height = params[:url].to_i
      up.state = 1
      up.source = 0
      url = request.url.split('?')[0] + "?success=" + (up.save ? "1" : "0")
      redirect_to url
    end

    # 列表数据
    @upyuns = Upyun.all.order("updated_at DESC").page(params[:page]).per(20)
---
INSERT INTO `upyuns` (`created_at`, `updated_at`, `url`) VALUES ('2014-10-24 06:28:51', '2014-10-24 06:28:51', '/2014/10/24/7f6bae7246b558ef3f4c6c22309137f2.jpg')
SELECT  `upyuns`.* FROM `upyuns`   ORDER BY updated_at DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `upyuns`