app/controllers/articles_controller.rb

  def index
    @articles = Article.where(state: 0, haspic: 1).order("rand()").limit(5)
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`state` = 0 AND `articles`.`haspic` = 1  ORDER BY rand() LIMIT 5

  def pc_show
    @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 122 LIMIT 1

  def sitemap
    @articles = Article.where(state: 0).order("pubtime DESC")
---
SELECT `articles`.* FROM `articles`  WHERE `articles`.`state` = 0  ORDER BY pubtime DESC

  def m_show
    @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 'id' LIMIT 1

  def admin_list
    return unless valid_auth? # 权限验证
    _state = params[:state] || 0
    _sign = params[:sign] || -1
    if(_sign == -1)
      @articles = Article.where(state: _state).order("pubtime DESC").page(params[:page]).per(20)
    else
      @articles = Article.where(state: _state, sign: _sign).order("pubtime DESC").page(params[:page]).per(20)
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`state` = 0  ORDER BY pubtime DESC LIMIT 20
SELECT COUNT(*) FROM `articles`  WHERE `articles`.`state` = 0
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`state` = 0 AND `articles`.`sign` = 1  ORDER BY pubtime DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `articles`  WHERE `articles`.`state` = 0 AND `articles`.`sign` = 1

  def admin_new
    return unless valid_auth? # 权限验证
    if(params[:id].to_s.length == 0)
      @article = Article.new
      @article.pubtime = Time.now.in_time_zone(+8.hours).strftime('%Y-%m-%d %H:%M:%S')
    else
      @article = Article.find(params[:id].to_i)
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 4098 LIMIT 1

  def admin_create
    return unless valid_auth? # 权限验证
    params.permit!
    if(params[:id].to_s.length == 0)
      refrash_haspic
      params[:article][:pubtime] = toUTC(params[:article][:pubtime])
      @article = Article.new(params[:article])
      redirect_to action:'admin_new', success: (@article.save ? "1" : "0")
---
INSERT INTO `articles` (`content`, `created_at`, `haspic`, `picpath`, `pubtime`, `tag`, `title`, `updated_at`) VALUES ('', '2014-10-30 10:46:39', 1, '/2014/10/26/900a7cf537b0a6e71e78b84c567b4537.png', '2014-10-30 09:46:25', '', '', '2014-10-30 10:46:39')

  def admin_update
    return unless valid_auth? # 权限验证
    params.permit!
    if(params[:id].to_s.length != 0)
      @article = Article.find(params[:id].to_i)
      refrash_haspic
      params[:article][:pubtime] = toUTC(params[:article][:pubtime])
      result = @article.update(params[:article])
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 4098 LIMIT 1
UPDATE `articles` SET `content` = '<p>呵，还不错嘛！</p>\r\n<p>2014-10-22 17:04:12</p>', `pubtime` = '2014-10-22 09:04:12', `title` = '时间测试', `updated_at` = '2014-10-22 09:04:56' WHERE `articles`.`id` = 4101

  def admin_delete
    return unless valid_auth? # 权限验证
    if(params[:id].to_s.length != 0)
      article = Article.find(params[:id].to_i)
      result = article.update_columns(state: 2) # 已删除状态
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 4103 LIMIT 1
UPDATE `articles` SET `articles`.`state` = 2 WHERE `articles`.`id` = 4104

  def admin_posting
    return unless valid_auth? # 权限验证
    if(request.get?)
      render :template => 'articles/admin/posting.html.erb', :layout => 'admin'
    elsif(request.post?)
      count = 0
      content = params[:content]
      arr = ParsePosting.new.parse(content)
      arr.each do|item|
        atc = Article.new
        atc.source = 0
        atc.state = 0
        atc.title = item["title"]
        atc.content = item["content"]
        atc.sign = item["sign"]
        atc.pubtime = Time.now.in_time_zone(-0.hours).strftime('%Y-%m-%d %H:%M:%S')
        count = count.next if(atc.save)
---
INSERT INTO `articles` (`content`, `created_at`, `pubtime`, `sign`, `title`, `updated_at`) VALUES ('某少妇一向我行我素，即使在公众场合给孩子喂哺人乳，也绝不扭捏。<br/>一次，他和丈夫带同孩子上馆子吃饭，孩子肚饿哭闹起来，少妇掀起衣角便给孩子喂奶。<br/>餐厅侍应走道她身旁，婉言请她不要当众喂奶。<br/>少妇大为光火，说道：“难道你认为喂哺人乳淫秽不雅吗？”<br/>“不是！”<br/>侍应礼貌地指着墙上告示说：“不过这儿禁止进食非本餐厅供应的食品。”', '2014-10-31 05:53:10', '2014-10-31 04:53:10', 1, '禁止进食非本餐厅供应的食品', '2014-10-31 05:53:10')